######################
# основные настройки #
######################

# показывать ли вид с камеры
SHOW_INPUT = True

# показывать ли отрисованную картинку
SHOW_OUTPUT = True

# ограничение fps
TARGET_FPS = 20

# цвет фона (для хромакея, например), BGRA
B_COLOR = (0, 255, 0, 255)

# во сколько раз уменьшать исходные картинки для анимации
DOWNSCALING = 1

###########################
# ключевые точки анимации #
###########################

# сдвиг тела по вертикали при "дыхании"
BREATHING_Y_OFFSET = int(6 / DOWNSCALING)
# скорость сдвига тела по вертикали при "дыхании"
BREATHING_SPD = 0.4 / DOWNSCALING
