DOWNSCALING = 1  # уменьшение исходных картинок анимации

LIMIT_HEAD_TILT = 15  # максимальный угол наклона головы на картинке

LIMIT_BROW_HIGH = int(10 / DOWNSCALING)  # насколько высоко можно поднять бровь на картинке
LIMIT_BROW_LOW = int(-2 / DOWNSCALING)  # насколько низко можно опустить бровь на картинке

HEAD_MAX_Y_OFFSET = int(10 / DOWNSCALING)  # максимальное смещение головы по вертикали

HEAD_ROT_POINT_Y = int(140 / DOWNSCALING)  # y точки вращения головы относительно центра картинки
R_BROW_ROT_X = int(194 / DOWNSCALING)  # х точки вращения правой брови относительно левого верхнего края картинки
R_BROW_ROT_Y = int(262 / DOWNSCALING)  # у точки вращения правой брови относительно левого верхнего края картинки
L_BROW_ROT_X = int(314 / DOWNSCALING)  # х точки вращения левой брови относительно левого верхнего края картинки
L_BROW_ROT_Y = int(256 / DOWNSCALING)  # у точки вращения левой брови относительно левого верхнего края картинки
BODY_ROT_Y = int(548 / DOWNSCALING)  # х точки вращения тела относительно левого верхнего края картинки
BODY_ROT_X = int(264 / DOWNSCALING)  # у точки вращения тела относительно левого верхнего края картинки

BREATHING_Y_OFFSET = int(6 / DOWNSCALING)  # сдвиг тела по вертикали при "дыхании"
BREATHING_SPD = int(0.4 / DOWNSCALING)  # скорость сдвига при "дыхании"
