LIMIT_BROW_HIGH = 10  # насколько высоко можно поднять бровь на картинке
LIMIT_BROW_LOW = -2  # насколько низко можно опустить бровь на картинке
LIMIT_HEAD_TILT = 15  # максимальный угол наклона головы на картинке

HEAD_MAX_Y_OFFSET = 5  # максимальное смещение головы по вертикали

DOWNSCALING = 2  # уменьшение исходных картинок анимации
# для следующих параметров учесть, что исходная картинка уменьшается в n раз и указавыть их с учетом уменьшения
HEAD_ROT_POINT_Y = 70  # положение y-координаты точки вращения головы относительно центра картинки
R_BROW_ROT_X = 97  # положение х-координаты точки вращения правой брови относительно левого верхнего края картинки
R_BROW_ROT_Y = 131  # положение у-координаты точки вращения правой брови относительно левого верхнего края картинки
L_BROW_ROT_X = 157  # положение х-координаты точки вращения левой брови относительно левого верхнего края картинки
L_BROW_ROT_Y = 123  # положение у-координаты точки вращения левой брови относительно левого верхнего края картинки
BODY_ROT_Y = 274  # положение х-координаты точки вращения тела относительно левого верхнего края картинки
BODY_ROT_X = 132  # положение у-координаты точки вращения тела относительно левого верхнего края картинки

BREATHING_Y_OFFSET = 3  # сдвиг тела по вертикали при "дыхании"
BREATHING_SPD = 0.1  # скорость сдвига при "дыхании"
